Revit 2024 API
Application.UpdateRenderAppearanceLibrary Method
 Updates the stored render appearance library, giving the Revit session access to any new RPC content.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void UpdateRenderAppearanceLibrary()
Visual Basic
Public Sub UpdateRenderAppearanceLibrary
Visual C++
public:
void UpdateRenderAppearanceLibrary()
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace